<a href="https://colab.research.google.com/github/nureeee/numpy-pandas/blob/main/210613_%ED%8C%90%EB%8B%A4%EC%8A%A42.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [6]:
df1 = [['호호', 22, 180],
               ["하하", 33, 180],
               ["히히", 18, 190]]


df1 = pd.DataFrame(df1)
df1

    0   1    2
0  호호  22  180
1  하하  33  180
2  히히  18  190

In [7]:
# 컬럼명 출력하기
df1.columns

RangeIndex(start=0, stop=3, step=1)

In [9]:
df1.columns = ['이름', '나이', '키']

In [10]:
# 컬럼명 바꾸기
df2 = df1.rename(
    columns = {
        '이름' : 'name'
    }
)
df2

  name  나이    키
0   호호  22  180
1   하하  33  180
2   히히  18  190

In [11]:
df2.index # 행의 인덱스 개념

RangeIndex(start=0, stop=3, step=1)

In [12]:
df2.info() # 데이터 프레임을 분석하기 전 반드시 확인하기

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   나이      3 non-null      int64
 2   키       3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

In [15]:
df2.describe() # 숫자형으로 된 컬럼들에 대한 각종 수치

              나이           키
count   3.000000    3.000000
mean   24.333333  183.333333
std     7.767453    5.773503
min    18.000000  180.000000
25%    20.000000  180.000000
50%    22.000000  180.000000
75%    27.500000  185.000000
max    33.000000  190.000000

In [16]:
df2.shape

(3, 3)

In [17]:
df2.head() # 기본으로는 상위 5개의 데이터를 보여준다..
# 보고싶은 만큼 ()안에 적기

  name  나이    키
0   호호  22  180
1   하하  33  180
2   히히  18  190

In [19]:
df2.tail(1) # 하의 데이터 보기

  name  나이    키
2   히히  18  190

In [20]:
df2.sort_index() # 인데스 오름차순 정렬 ascending = True가 기본

  name  나이    키
0   호호  22  180
1   하하  33  180
2   히히  18  190

In [21]:
df2.sort_index(ascending = False) # 내림차순

  name  나이    키
2   히히  18  190
1   하하  33  180
0   호호  22  180

In [22]:
# 컬럼 오름차순 정렬
df2.sort_values(by='name') # by : 옵션을 이용해 정렬의 시준이 되는 컬럼 지정 2개 이상도 가능

  name  나이    키
1   하하  33  180
0   호호  22  180
2   히히  18  190

In [23]:
#내림차순 정렬
df2.sort_values(by='name', ascending= False)

  name  나이    키
2   히히  18  190
0   호호  22  180
1   하하  33  180

In [24]:
# 두개 이상의 컬럼을 이용해 정렬
df2.sort_values(by=['name', '키'], ascending= False)
#name컬럼을 기준으로 정렬하고 키컬럼으로 정렬

  name  나이    키
2   히히  18  190
0   호호  22  180
1   하하  33  180

In [26]:
df2.sort_values(by=['name', '키'], ascending=[ False, True])
# name은 내림차순으로 키는 오름차순으로

  name  나이    키
2   히히  18  190
0   호호  22  180
1   하하  33  180

In [28]:
# 파일 copy하기
df3 = df2.copy()
df3

  name  나이    키
0   호호  22  180
1   하하  33  180
2   히히  18  190

In [29]:
hex(id(df2))

'0x7f77ddf96550'

In [30]:
hex(id(df3)) # 복사한 변수와는 다른 주소값을 갖는다...

'0x7f77ddd7d190'

In [31]:
df4 = df3

In [32]:
hex(id(df4)) # = 으로 값을 대입한 데이터에 대해서는 같은 주소값을 갖는다

'0x7f77ddd7d190'

In [33]:
#df3과 df4는 같은 객체를 참조 중이다.

In [34]:
df2

  name  나이    키
0   호호  22  180
1   하하  33  180
2   히히  18  190

In [35]:
# row 추가하기
new_data = {
    'name' : '치치...피스 ',
    '나이' : 25,
    '키' : 193
}
df1.append(new_data, ignore_index=True)

    이름  나이    키      name
0   호호  22  180       NaN
1   하하  33  180       NaN
2   히히  18  190       NaN
3  NaN  25  193  치치...피스

In [36]:
df1 #append함수는 데이터프레임 원본에 데이터를 추가한 것이 아니다.

   이름  나이    키
0  호호  22  180
1  하하  33  180
2  히히  18  190

In [37]:
# 데이터를 추가하고 대입해주기
df1 = df1.append(new_data, ignore_index=True)
df1

    이름  나이    키      name
0   호호  22  180       NaN
1   하하  33  180       NaN
2   히히  18  190       NaN
3  NaN  25  193  치치...피스

In [38]:
# 컬럼 추가
# 새로운 컬럼을 지정하고 값을 대입하기
df1['국적'] = '대한민국'

In [41]:
df1 # 국적에 대한 컬럼의 기본 값을 대한민국으로 넣어줌

    이름  나이    키      name    국적
0   호호  22  180       NaN  대한민국
1   하하  33  180       NaN  대한민국
2   히히  18  190       NaN  대한민국
3  NaN  25  193  치치...피스   대한민국

In [52]:
# 특정 데이터값을 변경하기
#loc활용
df1.loc[df1['키'] == 193, '국적'] = '그리스'

In [53]:
df1

    이름  나이    키      name    국적
0   호호  22  180       NaN  대한민국
1   하하  33  180       NaN  대한민국
2   히히  18  190       NaN  대한민국
3  NaN  25  193  치치...피스    그리스

In [58]:
df1.loc[df1['name'] == None, 'name'] = '바보' # 음... 안된다..노박은 이길 수 잇는건가요..

In [57]:
df1

    이름  나이    키      name    국적
0   호호  22  180       NaN  대한민국
1   하하  33  180       NaN  대한민국
2   히히  18  190       NaN  대한민국
3  NaN  25  193  치치...피스    그리스